#*YTKNSAIOUtkn#*YTKNSAIOUtkn
import re

LONGEST_KEY = 1

def lookup(key):
    assert len(key) <= LONGEST_KEY
    stroke = key[0]

    if stroke == "#":
        print("key error*")
        raise KeyError
    
    regex = re.compile(r"(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(\-?#?)(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(1?2?3?4?5?6?7?8?9?0?)")
    regex_groups = re.search(regex, stroke)

    LeftAsterisk = regex_groups.group(1)
    LeftY = regex_groups.group(2)
    LeftConsonant = regex_groups.group(3)
    LeftVowel = regex_groups.group(4)
    LeftParticle = regex_groups.group(5)
    MiddleHyphen = regex_groups.group(6)
    RightAsterisk = regex_groups.group(7)
    RightY = regex_groups.group(8)
    RightConsonant = regex_groups.group(9)
    RightVowel = regex_groups.group(10)
    RightParticle = regex_groups.group(11)
    Numbers = regex_groups.group(12)

    listvowel = ["","A","I","O","U","AI","AO","IU","OU","AIO"]
    result = ""
    if LeftVowel not in listvowel:
         LeftVowel = listvowel[9]
    if RightVowel not in listvowel:
         RightVowel = listvowel[9]

    LeftStroke = LeftY + LeftConsonant + LeftVowel + LeftParticle
    RightStroke = RightY + RightConsonant + RightVowel + RightParticle

    print("LeftAsterisk\tLeftConsonant\tLeftVowel\tLeftParticle")
    print(LeftAsterisk + "\t\t" + LeftStroke)

    print("RightAsterisk\tRightConsonant\tRightVowel\tRightParticle")
    print(RightAsterisk + "\t\t" + RightStroke)

    print(stroke)

    def 検索(stroke,list):
        flag = 0
        for i in range(len(list)):
            if list[i][0] == stroke:
                flag = i
        return flag
    
    kana = [["わ","い","う","え","お","っ"],#0
            ["か","き","く","け","こ","い"],#1
            ["が","ぎ","ぐ","げ","ご","い"],#2
            ["さ","し","す","せ","そ","し"],#3
            ["ざ","じ","ず","ぜ","ぞ","じ"],#4
            ["た","ち","つ","て","と","っ"],#5
            ["だ","ぢ","づ","で","ど","  "],#6
            ["な","に","ぬ","ね","の","ん"],#7
            ["は","ひ","ふ","へ","ほ","  "],#8
            ["ば","び","ぶ","べ","ぼ","ん"],#9
            ["ま","み","む","め","も","ん"],#10
            ["ら","り","る","れ","ろ","っ"],#11
            ["ら","い","る","れ","ろ","っ"]]#12


    五段 =   [0,1,2,2,3,3,4,5]
    上一段 = [1,1,1,1,1,1,1,1]
    下一段 = [3,3,3,3,3,3,3,3]
    カ変 =   [4,1,2,2,2,4,4,1]
    サ変 =   [1,1,2,2,2,3,1,1]#ない、用、止、体、仮、命、意、て・た
                #ストローク，語幹，段, 活用
    動詞リスト = [
                ["","",3,サ変],#する
                ["KSIU","よろしくおねがい",3,サ変],#よろしくおねがいする
                ["k","",1,カ変],#くる
#///////////////////////////////////////<上一段>///////////////////////////////////////
                ["I","",0,上一段],#いる
                ["KI","",1,上一段],#きる
                ["Otn","お",5,上一段],#おちる
                ["N","",7,上一段],#にる
                ["TKSI","の",9,上一段],#のびる
                ["KNkn","で",1,上一段],#できる
                ["TN","",10,上一段],#みる
                ["KSI","か",11,上一段],#かりる
#///////////////////////////////////////<下一段>///////////////////////////////////////
                ["AI","",0,下一段],#える
                ["AIk","か",0,下一段],#かえる
                ["AIkn","き",0,下一段],#きえる
                ["YTNAI","み",0,下一段],#みえる
                ["SAk","さ",1,下一段],#さける
                ["KAIt","つ",1,下一段],#つける
                ["TNS","み",3,下一段],#みせる
                ["St","す",5,下一段],#すてる
                ["KN","",6,下一段],#でる
                ["NAI","",7,下一段],#ねる
                ["TNSAI","たず",7,下一段],#たずねる
                ["KSAI","い",11,下一段],#
                ["KSIU","ゆ",11,下一段],#ゆれる
#////////////////////////////////////////<五段>/////////////////////////////////////
                ["AO","あ",0,五段],#あう
                ["OU","い",0,五段],#いう
                ["NSAO","うかが",0,五段],#うかがう
                ["KAO","か",0,五段],#かう
                ["KAOt","つか",0,五段],#つかう
                ["TKAO","は",0,五段],#はう
                ["Ok","お",1,五段],#おく
                ["kn","き",1,五段],#きく
                ["TKAk","は",1,五段],#はく
                ["YTKAk","はたら",1,五段],#はたらく
                ["Y","いた",3,五段],#いたす
                ["KAI","け",3,五段],#けす
                ["TNAI","ため",3,五段],#ためす
                ["NAO","なお",3,五段],#なおす
                ["YKSIU","よろしくおねがいいた",3,五段],#よろしくおねがいいたす
                ["TKNt","う",5,五段],#うつ
                ["NI","し",7,五段],#しぬ
                ["A","あ",11,五段],#ある
                ["O","お",11,五段],#おる
                ["KOU","かえ",11,五段],#かえる
                ["YKAI","け",11,五段],#ける
                ["NSO","ござ",12,五段],#ござる
                ["SI","し",12,五段],#しる
                ["TO","と",12,五段],#
                ["Tk","つく",12,五段],#つくる
                ["NA","な",12,五段],#なる
                ["TKA","は",12,五段],#はる
                ["AIO","ありがとうござ",12,五段],#ありがとうござる
                ["YAIO","もうしわけござ",12,五段],]#もうしわけござる

                #ストローク，語幹，活用形
    語尾リスト = [
                ["","",2],
                ["t",".",2],
                ["k",",",1],
                ["n","ん",2],
                ["tk","",1],
                ["tn","んだ",2],
                ["kn","んです",2],
                ["TO","と",2],
                ["KO","こと",2],
                ["KOt","ことだ",2],
                ["KOk","ことです",2],
                ["NO","の",2],
                ["NOt","のだ",2],
                ["NOk","のです",2],
                ["SO","そう",0],
                ["SOt","そうだ",0],
                ["SOk","そうです",0],
                ["SAO","そう",0],
                ["TNO","もの",2],
                ["TNOt","ものだ",2],
                ["TNOk","ものです",2],
                ["TNAO","のも",2],
                ["TNAI","ため",2],
                ["TNAIt","ためだ",2],
                ["TNAIk","ためです",2],
                ["KA","から",2],
                ["KAt","からだ",2],
                ["KAk","からです",2],
                ["OU","という",2],
                ["OUt","といった",2],
                ["OUk","といいます",2],
                ["OUtk","ということ",2],
                ["OUtn","といって",2],
                ["OUkn","といいまして",2],
                ["OUtkn","ということです",2],
                ["YKN","でしょう",2],
                ["KN","ことができる",2],
                ["KNt","ことができた",2],
                ["KNk","ことができます",2],
                ["KNn","ことができない",2],
                ["KNtk","ことができました",2],
                ["KNtn","ことができなかった",2],
                ["KNkn","ことができません",2],
                ["KNtkn","ことができませんでした",2],
                ["SA","なさい",0],
                ["YSA","なさい",0],
                ["TS","ず",0],
                ["NA","ない",0],
                ["NAt","なかった",0],
                ["NAk","なくて",0],
                ["TNAt","ました",1],
                ["TNAk","まして",1],
                ["TNAn","ません",1],
                ["TNAtn","ませんでした",1],
                ["TNA","ます",1],
                ["YTNA","ましょう",1],
                ["TA","た",7],
                ["TAt","たって",7],
                ["TAn","なかった",0],
                ["YTAI","ていただく",7],
                ["YTAIt","ていただいた",7],
                ["YTAIk","ていただきます",7],
                ["YTAItk","ていただきました",7],
                ["YTA","たい",7],
                ["YTAt","たかった",7],
                ["YTAk","たいです",7],
                ["YTAn","たくない",7],
                ["YTAtk","たかったです",7],
                ["YTAtn","たくなかった",7],
                ["YTAkn","たくないです",7],
                ["YTAtkn","たくなかったです",7],
                ["TAI","て",7],
                ["TAIt","てた",7],
                ["TAIk","まして",1],
                ["TAIn","なくて",0],
                ["A","てある",7],
                ["At","てあった",7],
                ["Ak","てあります",7],
                ["An","てない",7],
                ["Atk","てありました",7],
                ["Atn","てなかった",7],
                ["Akn","てありません",7],
                ["Atkn","てありませんでした",7],
                ["I","ている",7],
                ["It","ていた",7],
                ["Ik","ています",7],
                ["In","ていない",7],
                ["Itk","ていました",7],
                ["Itn","ていなかった",7],
                ["Ikn","ていません",7],
                ["Itkn","ていませんでした",7],
                ["O","ておく",7],
                ["Ot","ておいた",7],
                ["Ok","ておきます",7],
                ["On","ておかない",7],
                ["Otk","ておきました",7],
                ["Otn","ておかなかった",7],
                ["Okn","ておきません",7],
                ["Otkn","ておきませんでした",7],
                ["KAI","なければ",0],
                ["SAI","せる",0],
                ["SAIt","せた",0],
                ["SAIk","せます",0],
                ["SAIn","せない",0],
                ["SAItk","せました",0],
                ["SAItn","せなかった",0],
                ["SAIkn","せません",0],
                ["SAItkn","せませんでした",0],
                ["TKSA","ば",4],
                ["YI","よ",5],
                ["KSO","",5],
                ["Y","う",6],]
    #補助動詞 て+「いる・いらっしゃる・ある・やる・あげる・みる・いく・もらう・いただく・くださる・しまう・くる」
    #「た・て・ては・ての・ちゃ・せる・られる・ば・せよ・ない・なきゃ・ず・ぬ・ねば・ん・ざる・ざるをえない・ます・ました・まして・ません・ませんでした・よう／いれる・あげる・もうしあげる・くださる・いただく・だす・なおす・ながら・すぎる・つづける」

    い動詞 = [1,2]
    ん動詞 = [7,9,10]
    っ動詞 = [0,5,11]
    
    動詞index = 検索(LeftStroke,動詞リスト)
    語尾index = 検索(RightStroke,語尾リスト)
    動詞 = 動詞リスト[動詞index]
    語尾 = 語尾リスト[語尾index]

    result = 動詞[1] + kana[動詞[2]][動詞[3][語尾[2]]]
    if 語尾[2] == 2 and 動詞[3] != 五段:
        result += "る"
    elif 語尾[2] == 6 and 動詞[3] != 五段:
        result += "よ"
    elif 語尾[2] == 4 and 動詞[3] != 五段:
        result += "れ"
    elif 語尾[0] == "KSO" and 動詞[3] != 五段 and 動詞[3] != カ変:
        result += "ろ"

    result += 語尾[1]
    result = result.replace('んて', 'んで').replace('んた', 'んだ').replace('あらな', 'な').replace('すろ', 'しろ').replace('しず', 'せず')

    if LeftAsterisk:
        print("{^" + result + "^}")
        return "{^" + result + "^}"
    else:
        print("key error*")
        raise KeyError