#*YTKNSAIOUtkn#*YTKNSAIOUtkn
import re

LONGEST_KEY = 1

def lookup(key):
    assert len(key) <= LONGEST_KEY
    stroke = key[0]

    if stroke == "#":
        print("key error*")
        raise KeyError
    
    regex = re.compile(r"(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(\-?#?)(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(1?2?3?4?5?6?7?8?9?0?)")
    regex_groups = re.search(regex, stroke)

    LeftAsterisk = regex_groups.group(1)
    LeftY = regex_groups.group(2)
    LeftConsonant = regex_groups.group(3)
    LeftVowel = regex_groups.group(4)
    LeftParticle = regex_groups.group(5)
    MiddleHyphen = regex_groups.group(6)
    RightAsterisk = regex_groups.group(7)
    RightY = regex_groups.group(8)
    RightConsonant = regex_groups.group(9)
    RightVowel = regex_groups.group(10)
    RightParticle = regex_groups.group(11)
    Numbers = regex_groups.group(12)

    listParticle = ["","n","t","k","tk","tn","kn","tkn"]
                    #ない,た,ます,ました,なかった,ません,ませんでした
    listvowel = ["","A","I","O","U","AI","AO","IU","OU","AIO"]
    result = ""
    if LeftVowel not in listvowel:
         LeftVowel = listvowel[9]
    if RightVowel not in listvowel:
         RightVowel = listvowel[9]

    LeftStroke = LeftY + LeftConsonant + LeftVowel + LeftParticle
    RightStroke = RightY + RightConsonant + RightVowel + RightParticle

    print("LeftAsterisk\tLeftConsonant\tLeftVowel\tLeftParticle")
    print(LeftAsterisk + "\t\t" + LeftStroke)

    print("RightAsterisk\tRightConsonant\tRightVowel\tRightParticle")
    print(RightAsterisk + "\t\t" + RightStroke)

    print(stroke)

    if not LeftAsterisk:
        print("key error*")
        raise KeyError
    def 検索(stroke,list):
        flag = None
        for i in range(len(list)):
            if list[i][0] == stroke:
                flag = i
        return flag
    
    kana = [["わ","い","う","え","お","っ"],#0
            ["か","き","く","け","こ","い"],#1
            ["が","ぎ","ぐ","げ","ご","い"],#2
            ["さ","し","す","せ","そ","し"],#3
            ["ざ","じ","ず","ぜ","ぞ","じ"],#4
            ["た","ち","つ","て","と","っ"],#5
            ["だ","ぢ","づ","で","ど","  "],#6
            ["な","に","ぬ","ね","の","ん"],#7
            ["は","ひ","ふ","へ","ほ","  "],#8
            ["ば","び","ぶ","べ","ぼ","ん"],#9
            ["ま","み","む","め","も","ん"],#10
            ["ら","り","る","れ","ろ","っ"],#11
            ["ら","い","る","れ","ろ","っ"]]#12
    

    五段 =   [0,1,2,2,3,3,4,5]
    上一段 = [1,1,1,1,1,1,1,1]
    下一段 = [3,3,3,3,3,3,3,3]
    カ変 =   [4,1,2,2,2,4,4,1]
    サ変 =   [1,1,2,2,2,3,1,1]
            #未,用,止,体,仮,命,意,て・た

    動詞リスト = [
                ["","",3,サ変],#する
                ["KSIU","よろしくおねがい",3,サ変],#よろしくおねがいする
                ["k","",1,カ変],#くる
#///////////////////////////////////////<上一段>///////////////////////////////////////
                ["I","",0,上一段],#いる
                ["YKI","い",1,上一段],#いきる
                ["KI","",1,上一段],#きる
                ["NSI","す",2,上一段],#すぎる
                ["Otn","お",5,上一段],#おちる
                ["N","",7,上一段],#にる
                ["TKSI","の",9,上一段],#のびる
                ["KNkn","で",1,上一段],#できる
                ["TN","",10,上一段],#みる
                ["KSI","か",11,上一段],#かりる
#///////////////////////////////////////<下一段>///////////////////////////////////////
                ["AI","",0,下一段],#える
                ["AIk","か",0,下一段],#かえる
                ["AIkn","き",0,下一段],#きえる
                ["YTNAI","み",0,下一段],#みえる
                ["SAk","さ",1,下一段],#さける
                ["KAIt","つ",1,下一段],#つける
                ["KNt","つづ",1,下一段],#つづける
                ["NSAI","あ",2,下一段],#あげる
                ["TNS","み",3,下一段],#みせる
                ["St","す",5,下一段],#すてる
                ["KN","",6,下一段],#でる
                ["NAI","",7,下一段],#ねる
                ["TNSAI","たず",7,下一段],#たずねる
                ["KSAI","い",11,下一段],#いれる
                ["KSIU","ゆ",11,下一段],#ゆれる
#////////////////////////////////////////<五段>/////////////////////////////////////
                ["AO","あ",0,五段],#あう
                ["OU","い",0,五段],#いう
                ["NSAO","うかが",0,五段],#うかがう
                ["KAO","か",0,五段],#かう
                ["TNAO","しま",0,五段],#しまう
                ["KAOt","つか",0,五段],#つかう
                ["TKAO","は",0,五段],#はう
                ["KSAO","もら",0,五段],#もらう
                ["KNAtk","いただ",1,五段],#いただく
                ["Ok","お",1,五段],#おく
                ["kn","き",1,五段],#きく
                ["TKAk","は",1,五段],#はく
                ["YTKAk","はたら",1,五段],#はたらく
                ["Uk","や",1,五段],#やく
                ["Y","いた",3,五段],#いたす
                ["KAI","け",3,五段],#けす
                ["TNAI","ため",3,五段],#ためす
                ["KNA","だ",3,五段],#だす
                ["NAO","なお",3,五段],#なおす
                ["TKAn","はな",3,五段],#はなす
                ["YKSIU","よろしくおねがいいた",3,五段],#よろしくおねがいいたす
                ["TKNt","う",5,五段],#うつ
                ["NI","し",7,五段],#しぬ
                ["A","あ",11,五段],#ある
                ["YI","いらっしゃ",11,五段],#いらっしゃる
                ["O","お",11,五段],#おる
                ["Okn","おこ",11,五段],#おこる
                ["KOU","かえ",11,五段],#かえる
                ["YKNAk","くださ",11,五段],#くださる
                ["KSAIk","くれ",11,五段],#くれる
                ["YKAI","け",11,五段],#ける
                ["SI","し",11,五段],#しる
                ["TO","と",11,五段],#とる
                ["Tk","つく",11,五段],#つくる
                ["NA","な",11,五段],#なる
                ["TKA","は",11,五段],#はる
                ["YTNA","まい",11,五段],#まいる
                ["U","や",11,五段],#やる
                ["TKNAk","わか",11,五段],#わかる
                ["NSO","ござ",12,五段],#ござる
                ["AIO","ありがとうござ",12,五段],#ありがとうござる
                ["YAIO","もうしわけござ",12,五段],#もうしわけござる
                ]
    補助動詞リスト = [
                ["K","て",1,カ変,7],#てくる
                ["I","て",0,上一段,7],#ている
                ["NSI","す",2,上一段,1],#すぎる
                ["KNAI","ことがで",1,上一段,2],#ことができる
                ["TN","て",10,上一段,7],#てみる
                ["AI","",0,下一段,1],#える
                ["KAI","つ",1,下一段,1],#つける
                ["T","つづ",1,下一段,1],#つづける
                ["NSAI","てあ",2,下一段,7],#てあげる
                ["YNSAI","あ",2,下一段,1],#あげる
                ["TNS","てみ",3,下一段,7],#てみせる
                ["S","す",5,下一段,1],#すてる
                ["KN","",6,下一段,1],#でる
                ["KSAI","い",11,下一段,1],#いれる
                ["AO","あ",0,五段,1],#あう
                ["OU","てい",0,五段,7],#ていう
                ["YOU","とい",0,五段,2],#という
                ["TNAO","てしま",0,五段,7],#てしまう
                ["KSAO","てもら",0,五段,7],#てもらう
                ["TA","ていただ",1,五段,7],#ていただく
                ["O","てお",1,五段,7],#ておく
                ["KNA","だ",3,五段,1],#だす
                ["NAO","なお",3,五段,1],#なおす
                ["A","てあ",11,五段,7],#てある
                ["YI","ていらっしゃ",11,五段,7],#ていらっしゃる
                ["O","てお",11,五段,7],#ておる
                ["YKNA","てくださ",11,五段,7],#てくださる
                ["TO","と",11,五段,1],#とる
                ["NA","にな",11,五段,1],#お~になる
                ["TKA","は",11,五段,1],#はる
                ["U","てや",11,五段,7],#てやる
                ]
                #ストローク，語幹，活用形
    助詞リスト = [["","",2],
                ["t",".",2],
                ["k",",",1],
                ["n","ん",2],
                ["tk","",1],
                ["tn","んだ",2],
                ["kn","んです",2],
                ["tkn","んですよ",2],
                ["Yn","んでしょう",2],
                ["TNA","ます",1],
                ["TNAt","ました",1],
                ["TNAk","ますか",1],
                ["TNAn","ません",1],
                ["TNAtk","ましたか",1],
                ["TNAtn","ませんでした",1],
                ["TNAkn","ませんか",1],
                ["TNAtkn","ませんでしたか",1],
                ["YTNA","ましょう",1],
                ["YTNAk","ましょうか",1],
                ["TAI","て",7],
                ["TO","と",2],
                ["KO","こと",2],
                ["KOt","ことだ",2],
                ["KOk","ことです",2],
                ["YKO","ことでしょう",2],
                ["NO","の",2],
                ["NOt","のだ",2],
                ["NOk","のです",2],
                ["YNO","のでしょう",2],
                ["SO","そう",0],
                ["SOt","そうだ",0],
                ["SOk","そうです",0],
                ["YSO","そうでしょう",0],
                ["SAO","そう",0],
                ["SAOt","そうだ",0],
                ["SAOk","そうです",0],
                ["YSAO","そうでしょう",0],
                ["TNO","もの",2],
                ["TNOt","ものだ",2],
                ["TNOk","ものです",2],
                ["YTNO","ものでしょう",2],
                ["TNAO","のも",2],
                ["TNAI","ため",2],
                ["TNAIt","ためだ",2],
                ["TNAIk","ためです",2],
                ["YTNAI","ためでしょう",2],
                ["KA","から",2],
                ["KAt","からだ",2],
                ["KAk","からです",2],
                ["YKA","からでしょう",2],
                ["YKN","でしょう",2],
                ["SA","なさい",0],
                ["YSA","なさい",0],
                ["TS","ず",0],
                ["YTA","たい",7],
                ["YTAt","たかった",7],
                ["YTAk","たいです",7],
                ["YTAn","たくない",7],
                ["YTAtk","たかったです",7],
                ["YTAtn","たくなかった",7],
                ["YTAkn","たくないです",7],
                ["YTAtkn","たくなかったです",7],
                ["TKSA","ば",4],
                ["YI","よ",5],
                ["KSO","",5],
                ["Y","う",6],]
    
    活用リスト = [["","",2],
                ["t","た",7],
                ["k","ます",1],
                ["n","ない",0],
                ["tk","ました",1],
                ["tn","なかった",0],
                ["kn","ません",1],
                ["tkn","ませんでした",1]]
    
    #補助動詞 て+「いる・いらっしゃる・ある・やる・あげる・みる・いく・もらう・いただく・くださる・しまう・くる」
    #「た・て・ては・ての・ちゃ・せる・られる・ば・せよ・ない・なきゃ・ず・ぬ・ねば・ん・ざる・ざるをえない・ます・ました・まして・ません・ませんでした・よう／いれる・あげる・もうしあげる・くださる・いただく・だす・なおす・ながら・すぎる・つづける」
    #  動詞*(助動詞／補助動詞／名詞)*(丁寧／過去／否定)*(、。)

    動詞index = 検索(LeftStroke,動詞リスト)
    助詞index = 検索(RightStroke,助詞リスト)
    補助index = 検索(RightY + RightConsonant + RightVowel,補助動詞リスト)
    活用index = 検索(RightParticle,活用リスト)

    if not 動詞index:
        動詞index = 0
    if not 助詞index:
        助詞index = 0
    if not 活用index:
        活用index = 0
    動詞 = 動詞リスト[動詞index]
    助詞 = 助詞リスト[助詞index]
    活用 = 活用リスト[活用index]
    if not 補助index:

        result = 動詞[1] + kana[動詞[2]][動詞[3][助詞[2]]]

        if 助詞[2] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"
        elif 助詞[2] == 6 and 動詞[3] != 五段:#意思
            result += "よ"
        elif 助詞[2] == 4 and 動詞[3] != 五段:#仮定
            result += "れ"
        elif 助詞[0] == "KSO" and 動詞[3] != 五段 and 動詞[3] != カ変:#命令形
            result += "ろ"

        result += 助詞[1]

        result = result.replace('んて', 'んで').replace('んた', 'んだ').replace('あらな', 'な').replace('すろ', 'しろ').replace('しず', 'せず')
    else:
        補助動詞 = 補助動詞リスト[補助index]
        if 補助動詞[0] == "NA":
            result = "お"    
        result += 動詞[1] + kana[動詞[2]][動詞[3][補助動詞[4]]]

        if 補助動詞[4] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"

        result += 補助動詞[1] + kana[補助動詞[2]][補助動詞[3][活用[2]]] + 活用[1]
        
        if 活用[2] == 2 and 補助動詞[3] != 五段:#五段以外の終止形
            result += "る"
        result = result.replace('んて', 'んで').replace('んた', 'んだ').replace('あらな', 'な').replace('すろ', 'しろ').replace('しず', 'せず')
    print("{^" + result + "^}")
    return "{^" + result + "^}"