#*YTKNSAIOUtkn#*YTKNSAIOUtkn
import re

LONGEST_KEY = 1

def lookup(key):
    assert len(key) <= LONGEST_KEY
    stroke = key[0]

    if stroke == "#":
        print("key error*")
        raise KeyError
    
    regex = re.compile(r"(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(\-?#?)(\*?)(Y?)(T?K?N?S?)(A?I?O?U?)(t?k?n?)(1?2?3?4?5?6?7?8?9?0?)")
    regex_groups = re.search(regex, stroke)

    LeftAsterisk = regex_groups.group(1)
    LeftY = regex_groups.group(2)
    LeftConsonant = regex_groups.group(3)
    LeftVowel = regex_groups.group(4)
    LeftParticle = regex_groups.group(5)
    MiddleHyphen = regex_groups.group(6)
    RightAsterisk = regex_groups.group(7)
    RightY = regex_groups.group(8)
    RightConsonant = regex_groups.group(9)
    RightVowel = regex_groups.group(10)
    RightParticle = regex_groups.group(11)
    Numbers = regex_groups.group(12)

    listvowel = ["","A","I","O","U","AI","AO","IU","OU","AIO"]
    result = ""
    if LeftVowel not in listvowel:
         LeftVowel = listvowel[9]
    if RightVowel not in listvowel:
         RightVowel = listvowel[9]

    LeftStroke = LeftY + LeftConsonant + LeftVowel + LeftParticle
    RightStroke = RightY + RightConsonant + RightVowel

    print("LeftAsterisk\tLeftConsonant\tLeftVowel\tLeftParticle")
    print(LeftAsterisk + "\t\t" + LeftStroke)

    print("RightAsterisk\tRightConsonant\tRightVowel\tRightParticle")
    print(RightAsterisk + "\t\t" + RightStroke)

    print(stroke)

    if not LeftAsterisk:
        print("key error*")
        raise KeyError
    def 検索(stroke,list,error):
        flag = error
        for i in range(len(list)):
            if list[i][0] == stroke:
                flag = i
        return flag
    
    def 修正(result):
        return result.replace('んて', 'んで').replace('んた', 'んだ').replace('あらな', 'な').replace('せろ', 'しろ').replace('しせ', 'させ')
    
    kana = [["わ","い","う","え","お","っ"],#0
            ["か","き","く","け","こ","い"],#1
            ["が","ぎ","ぐ","げ","ご","い"],#2
            ["さ","し","す","せ","そ","し"],#3
            ["ざ","じ","ず","ぜ","ぞ","じ"],#4
            ["た","ち","つ","て","と","っ"],#5
            ["だ","ぢ","づ","で","ど","  "],#6
            ["な","に","ぬ","ね","の","ん"],#7
            ["は","ひ","ふ","へ","ほ","  "],#8
            ["ば","び","ぶ","べ","ぼ","ん"],#9
            ["ま","み","む","め","も","ん"],#10
            ["ら","り","る","れ","ろ","っ"],#11
            ["ら","い","る","れ","ろ","っ"],#12
            ["","","","","",""]]
    
    五段 =   [0,1,2,2,3,3,4,5,0,3]
    上一段 = [1,1,1,1,1,1,1,1,1,3]
    下一段 = [3,3,3,3,3,3,3,3,3,3]
    カ変 =   [4,1,2,2,2,4,4,1,4,3]
    サ変 =   [1,1,2,2,2,3,1,1,3,3]
            #未,用,止,体,仮,命,意,て,古典的否定,える(可能)

    動詞リスト = [
                ["","",3,サ変],#する
                ["KSAIO","よろしくおねがい",3,サ変],#よろしくおねがいする
                ["k","",1,カ変],#くる
#///////////////////////////////////////<上一段>///////////////////////////////////////
                ["I","",0,上一段],#いる
                ["SIU","し",0,上一段],#しいる
                ["YTAI","て",0,上一段],#ている
                ["YKI","い",1,上一段],#いきる
                ["KI","",1,上一段],#きる
                ["KNkn","で",1,上一段],#できる
                ["NSI","す",2,上一段],#すぎる
                ["TKAtk","は",4,上一段],#はじる
                ["Otn","お",5,上一段],#おちる
                ["N","",7,上一段],#にる
                ["TKSI","の",9,上一段],#のびる
                ["TN","",10,上一段],#みる
                ["NSAn","かんが",10,上一段],#かんがみる
                ["KSI","か",11,上一段],#かりる
                ["TA","た",11,上一段],#たりる
#///////////////////////////////////////<下一段>///////////////////////////////////////
                ["YTOU","あた",0,下一段],#あたえる
                ["AI","",0,下一段],#える
                ["KOU","か",0,下一段],#かえる
                ["NSAk","かんが",0,下一段],#かんがえる
                ["TOUk","こた",0,下一段],#こたえる
                ["AIkn","き",0,下一段],#きえる
                ["TOU","た",0,下一段],#たえる
                ["TOUt","つた",0,下一段],#つたえる
                ["YTK","ふ",0,下一段],#ふえる
                ["YTN","み",0,下一段],#みえる
                ["YKA","か",1,下一段],#かける
                ["SAk","さ",1,下一段],#さける
                ["YSAt","さず",1,下一段],#さずける
                ["YTAtk","たす",1,下一段],#たすける
                ["KAIt","つ",1,下一段],#つける
                ["KNt","つづ",1,下一段],#つづける
                ["NSAI","あ",2,下一段],#あげる
                ["SAkn","さ",2,下一段],#さげる
                ["SAn","さまた",2,下一段],#さまたげる
                ["YSIU","しいた",2,下一段],#しいたげる
                ["SAI","",3,下一段],#せる
                ["SA","さ",3,下一段],#させる
                ["TNS","み",3,下一段],#みせる
                ["YTNSAI","ま",4,下一段],#まぜる
                ["St","す",5,下一段],#すてる
                ["KN","",6,下一段],#でる
                ["NAI","",7,下一段],#ねる
                ["TNSAI","たず",7,下一段],#たずねる
                ["TKAI","",8,下一段],#へる
                ["YSI","しら",9,下一段],#しらべる
                ["TNAIkn","き",10,下一段],#きめる
                ["YSAn","さ",10,下一段],#さめる
                ["SAtn","さだ",10,下一段],#さだめる
                ["SIn","し",10,下一段],#しめる
                ["YS","すす",10,下一段],#すすめる
                ["KNO","とど",10,下一段],#とどめる
                ["YTKAtn","はじ",10,下一段],#はじめる
                ["YKSAI","い",11,下一段],#いれる
                ["KSAI","",11,下一段],#れる
                ["KSIU","ゆ",11,下一段],#ゆれる
#////////////////////////////////////////<五段>/////////////////////////////////////
                ["TKNS","",13,五段],#NULL
                ["AO","あ",0,五段],#あう
                ["YKAOt","あつか",0,五段],#あつかう
                ["OU","い",0,五段],#いう
                ["Okn","おこな",0,五段],#おこなう
                ["YO","おも",0,五段],#おもう
                ["NSAO","うかが",0,五段],#うかがう
                ["KAO","か",0,五段],#かう
                ["SAO","そ",0,五段],#そう
                ["TNAO","しま",0,五段],#しまう
                ["YTAO","たと",0,五段],#たとう
                ["KAOt","つか",0,五段],#つかう
                ["KNAOt","つど",0,五段],#つどう
                ["TAO","と",0,五段],#とう
                ["TKAO","は",0,五段],#はう
                ["TKAOk","はから",0,五段],#はからう
                ["YTKAO","はら",0,五段],#はらう
                ["TNAO","ま",0,五段],#まう
                ["KSAO","もら",0,五段],#もらう
                ["Ik","い",1,五段],#いく
                ["KNAtk","いただ",1,五段],#いただく
                ["Ok","お",1,五段],#おく
                ["KAk","か",1,五段],#かく
                ["kn","き",1,五段],#きく
                ["TAk","た",1,五段],#たく
                ["Nk","ぬ",1,五段],#ぬく
                ["TKAk","は",1,五段],#はく
                ["YTKAk","はたら",1,五段],#はたらく
                ["TNAk","ま",1,五段],#まく
                ["Uk","や",1,五段],#やく
                ["TKS","ふせ",2,五段],#ふせぐ
                ["YA","あい",3,五段],#あいす
                ["Y","いた",3,五段],#いたす
                ["KAI","け",3,五段],#けす
                ["TNAI","ため",3,五段],#ためす
                ["KNA","だ",3,五段],#だす
                ["NAO","なお",3,五段],#なおす
                ["TKAn","はな",3,五段],#はなす
                ["TKU","ふや",3,五段],#ふやす
                ["YTNAO","もう",3,五段],#もうす
                ["SOU","ゆる",3,五段],#ゆるす
                ["YKSAIO","よろしくおねがいいた",3,五段],#よろしくおねがいいたす
                ["YAt","あいま",5,五段],#あいまつ
                ["TKNt","う",5,五段],#うつ
                ["TAt","た",5,五段],#たつ
                ["NI","し",7,五段],#しぬ
                ["TNAn","まな",9,五段],#まなぶ
                ["S","すす",10,五段],#すすむ
                ["IU","ゆる",10,五段],#ゆるむ
                ["A","あ",11,五段],#ある
                ["YNSA","あが",11,五段],#あがる
                ["YI","いらっしゃ",11,五段],#いらっしゃる
                ["O","お",11,五段],#おる
                ["YOk","おくれ",11,五段],#おくれる
                ["KS","おこ",11,五段],#おこる
                ["YTKNA","おわ",11,五段],#おわる
                ["KA","か",11,五段],#かる
                ["YKOU","かえ",11,五段],#かえる
                ["NSI","かぎ",11,五段],#かぎる
                ["NSA","がんば",11,五段],#がんばる
                ["YKNAk","くださ",11,五段],#くださる
                ["KSAIk","くれ",11,五段],#くれる
                ["YKAI","け",11,五段],#ける
                ["YSA","さ",11,五段],#さる
                ["SAtk","さずか",11,五段],#さずかる
                ["SAt","さだま",11,五段],#さだまる
                ["SO","そ",11,五段],#そる
                ["SI","し",11,五段],#しる
                ["TAtk","たすか",11,五段],#たすかる
                ["T","つ",11,五段],#つる
                ["Kt","つく",11,五段],#つくる
                ["TO","と",11,五段],#とる
                ["NA","な",11,五段],#なる
                ["TKA","は",11,五段],#はる
                ["YTKA","はい",11,五段],#はいる
                ["TKAtn","はじま",11,五段],#はじまる
                ["YTKAtk","はずかしが",11,五段],#はずかしがる
                ["TK","ふ",11,五段],#ふる
                ["YTKAI","へ",11,五段],#へる
                ["YTNA","まい",11,五段],#まいる
                ["U","や",11,五段],#やる
                ["TSOU","ゆず",11,五段],#ゆずる
                ["TKNA","わ",11,五段],#わる
                ["TKNAk","わか",11,五段],#わかる
                ["NSO","ござ",12,五段],#ござる
                ["AIO","ありがとうござ",12,五段],#ありがとうござる
                ["YAIO","もうしわけござ",12,五段],#もうしわけござる
                ]
    補助動詞リスト = [
                ["K","て",1,カ変,7],#てくる
                ["I","て",0,上一段,7],#ている
                ["NSI","す",2,上一段,1],#すぎる
                ["KN","ことがで",1,上一段,2],#ことができる
                ["TN","て",10,上一段,7],#てみる
                ["AI","",0,下一段,1],#える
                ["KOU","か",0,下一段,1],#かえる
                ["YAI","",13,下一段,5],#える(可能)
                ["KAI","つ",1,下一段,1],#つける
                ["T","つづ",1,下一段,1],#つづける
                ["YNSAI","てあ",2,下一段,7],#てあげる
                ["NSAI","あ",2,下一段,1],#あげる
                ["TNS","てみ",3,下一段,7],#てみせる
                ["SA","",3,下一段,0],#させる(使役)
                ["S","す",5,下一段,1],#すてる
                ["YKN","",6,下一段,1],#でる
                ["TKA","はじ",10,下一段,1],#はじめる
                ["YKSAI","い",11,下一段,1],#いれる
                ["KSAI","",11,下一段,0],#れる(ら抜き)
                ["KSA","",11,下一段,0],#られる
                ["AO","あ",0,五段,1],#あう
                ["OU","とい",0,五段,2],#という
                ["YO","とおも",0,五段,2],#とおもう
                ["TNAO","てしま",0,五段,7],#てしまう
                ["KSAO","てもら",0,五段,7],#てもらう
                ["TA","ていただ",1,五段,7],#ていただく
                ["O","てお",1,五段,7],#ておく
                ["SAI","せていただ",1,五段,0],#させていただく
                ["KNA","だ",3,五段,1],#だす
                ["NAO","なお",3,五段,1],#なおす
                ["A","てあ",11,五段,7],#てある
                ["YTAI","ていらっしゃ",11,五段,7],#ていらっしゃる
                ["O","てお",11,五段,7],#ておる
                ["TKNA","おわ",11,五段,1],#おわる
                ["NSA","がんば",11,五段,7],#がんばって~
                ["YKNA","てくださ",11,五段,7],#てくださる
                ["TO","と",11,五段,1],#とる
                ["N","にな",11,五段,1],#お~になる
                ["U","てや",11,五段,7],#てやる
                ]
                #ストローク,語幹,活用形,名詞・助詞
    助詞リスト = [["","",2,0],
                ["TKNS","",1,5],
                ["YA",",",1,2],
                ["KS",",",1,5],
                ["TAI","て",7,5],
                ["NA","ながら",1,5],
                ["TO","と",2,5],
                ["KO","こと",2,1],
                ["NO","の",2,1],
                ["TNO","もの",2,1],
                ["SAO","そう",0,1],
                ["TNAO","のも",2,5],
                ["TNAI","ため",2,1],
                ["KA","から",2,1],
                ["YSA","なさい",1,3],
                ["TS","ず",8,3],
                ["KU","なきゃ",0,3],
                ["NI","ぬ",8,3],
                ["NAI","ねば",8,3],
                ["TSA","ざる",8,3],
                ["TSAI","ざるをえない",8,3],
                ["TU","ちゃ",7,3],
                ["YTU","ちゃう",7,3],
                ["YTA","た",1,4],
                ["TNA","たまま",7,5],
                ["TKSA","ば",4,5],
                ["YI","よ",5,3],
                ["KSO","",5,3],
                ["TKN","う",6,3],
                ]
                    #動詞,名詞,助詞,語尾,たい,接続
    活用リスト = [["",["","","","","い",""],2],
                ["t",["た","だ","ので","な","かった","は"],7],
                ["k",["ます","です","です","か","いです","の"],1],
                ["n",["ない","の","ん","の","くない",","],0],
                ["tk",["ました","は","と","と","かった","で"],1],
                ["tn",["なかった","で","ため","わ","くなかった","と"],0],
                ["kn",["ません","が","から","ね","くないです","か"],1],
                ["tkn",["","でしょう","よ","よ","くなかったです","が"],1]]

    動詞index = 検索(LeftStroke,動詞リスト,0)
    助詞index = 検索(RightStroke,助詞リスト,0)
    補助index = 検索(RightStroke,補助動詞リスト,None)
    活用index = 検索(RightParticle,活用リスト,0)

    動詞 = 動詞リスト[動詞index]
    活用 = 活用リスト[活用index]
    助詞 = 助詞リスト[助詞index]
    if not 補助index and 助詞index == 0:#左の動詞だけ
        result = 動詞[1] + kana[動詞[2]][動詞[3][活用[2]]]

        if 活用[2] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"

        result += 活用[1][0]
        if RightStroke == "Y":
            result += "でしょう"
        result = 修正(result)
    elif not 補助index:#右の補助動詞以外
        result = 動詞[1] + kana[動詞[2]][動詞[3][助詞[2]]]

        if 助詞[2] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"
        elif 助詞[2] == 6 and 動詞[3] != 五段:#意思
            result += "よ"
        elif 助詞[2] == 4 and 動詞[3] != 五段:#仮定
            result += "れ"
        elif 助詞[0] == "KSO" and 動詞[3] != 五段 and 動詞[3] != カ変:#命令形
            result += "ろ"
        
        result += 助詞[1] + 活用[1][助詞[3]]

        result = 修正(result)
    elif RightStroke == "NSA":#頑張って～する
        補助動詞 = 補助動詞リスト[補助index]
        result = "がんばって"
        result += 動詞[1] + kana[動詞[2]][動詞[3][活用[2]]] + 活用[1][0]

        if 活用[2] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"
        result = 修正(result)
    else:
        補助動詞 = 補助動詞リスト[補助index]
        if 補助動詞[0] == "N":
            result = "お"    
        result += 動詞[1] + kana[動詞[2]][動詞[3][補助動詞[4]]]

        if 補助動詞[0] == "SA" and 動詞[3] != 五段 and 動詞[3] != サ変:#使役
            result += "さ"
        if 補助動詞[0] == "KSA" and 動詞[3] != 五段 and 動詞[3] != サ変:#受け身
            result += "ら"
        if 補助動詞[0] == "YAI" and 動詞[3] != 五段 and 動詞[3] != サ変:#可能
            result += "れ"
        if 補助動詞[4] == 2 and 動詞[3] != 五段:#五段以外の終止形
            result += "る"

        result += 補助動詞[1] + kana[補助動詞[2]][補助動詞[3][活用[2]]] + 活用[1][0]
        
        if 活用[2] == 2 and 補助動詞[3] != 五段:#五段以外の終止形
            result += "る"
        result = 修正(result)

    if RightAsterisk:
        result += ".}{#Space}{#Return}{"
    print("{^" + result + "^}")
    return "{^" + result + "^}"